var khmer_holidays = [

        {
            day: "2025-01-01",
            desc: "បុណ្យចូលឆ្នាំសាកល International New Year's Day"
        },
        {
            day: "2025-01-07",
            desc: "ទិវា​ជ័យ​ជម្នះ​លើ​របប​ប្រល័យ​ពូជ​សាសន៍ Victory Day"
        },
        {
            day: "2025-03-08",
            desc: "ទិវាសិទ្ធនារី ៨មីនា International Women's Day"
        },
        {
            day: "2025-04-14",
            desc: "បុណ្យចូលឆ្នាំប្រពៃណីខ្មែរ (Khmer New Year's Day)"
        },
        {
            day: "2025-04-15",
            desc: "បុណ្យចូលឆ្នាំប្រពៃណីខ្មែរ (Khmer New Year's Day)"
        },
        {
            day: "2025-04-16",
            desc: "បុណ្យចូលឆ្នាំប្រពៃណីខ្មែរ (Khmer New Year's Day)"
        },
        {
            day: "2025-05-11",
            desc: "ពិធី​បុណ្យ​វិសាខ​បូជា (Visak Bochea)"
        },
        {
            day: "2025-05-14",
            desc: "ព្រះ​រាជ​ពិធី​បុណ្យ​ចម្រើន​ព្រះ​ជន្ម ព្រះ​ករុណា​ព្រះ​បាទ​សម្តេច​ព្រះ​បរម​នាថ នរោត្តម សីហមុនី ព្រះ​មហាក្សត្រ​នៃ​ព្រះរាជាណាចក្រ​កម្ពុជា (King Sihamoni's Birthday)"
        },
        {
            day: "2025-05-15",
            desc: "ព្រះ​រាជ​ពិធី​ច្រត់​ព្រះ​នង្គ័ល (Royal Ploughing Ceremony)"
        },
        {
            day: "2025-06-18",
            desc: "ព្រះ​រាជ​ពិធី​បុណ្យ​ចម្រើន​ព្រះ​ជន្ម សម្តេច​ព្រះ​មហាក្សត្រី នរោត្តម មុនិនាថ សីហនុ ព្រះ​វររាជ​មាតា​ជាតិ​ខ្មែរ ក្នុង​សេរីភាព សេចក្តីថ្លៃថ្នូរ និង​សុភមង្គល (Queen Mother's Birthday)"
        },

    ]

var events = [
  {'Date': new Date('2025-6-7'), 'Title': 'Doctor appointment at 3:25pm.'},
  {'Date': new Date('2025-6-18'), 'Title': 'New Garfield movie comes out!', 'Link': 'https://garfield.com'},
  {'Date': new Date('2025-6-27'), 'Title': '25 year anniversary', 'Link': 'https://www.google.com.au/#q=anniversary+gifts'},
];
var settings = {};
var element = document.getElementById('caleandar');
caleandar(element, events, settings);
