
var khmer_holidays = [

    {
        day: "2026-01-01",
        desc: "បុណ្យចូលឆ្នាំសាកល International New Year's Day"
    },
    {
        day: "2026-01-07",
        desc: "ទិវា​ជ័យ​ជម្នះ​លើ​របប​ប្រល័យ​ពូជ​សាសន៍ Victory Day"
    },
    {
        day: "2026-03-08",
        desc: "ទិវាសិទ្ធនារី ៨មីនា International Women's Day"
    },
    {
        day: "2026-04-14",
        desc: "បុណ្យចូលឆ្នាំប្រពៃណីខ្មែរ (Khmer New Year's Day)"
    },
    {
        day: "2026-04-15",
        desc: "បុណ្យចូលឆ្នាំប្រពៃណីខ្មែរ (Khmer New Year's Day)"
    },
    {
        day: "2026-04-16",
        desc: "បុណ្យចូលឆ្នាំប្រពៃណីខ្មែរ (Khmer New Year's Day)"
    },
    {
        day: "2026-05-11",
        desc: "ពិធី​បុណ្យ​វិសាខ​បូជា (Visak Bochea)"
    },
    {
        day: "2026-05-14",
        desc: "ព្រះ​រាជ​ពិធី​បុណ្យ​ចម្រើន​ព្រះ​ជន្ម ព្រះ​ករុណា​ព្រះ​បាទ​សម្តេច​ព្រះ​បរម​នាថ នរោត្តម សីហមុនី ព្រះ​មហាក្សត្រ​នៃ​ព្រះរាជាណាចក្រ​កម្ពុជា (King Sihamoni's Birthday)"
    },
    {
        day: "2026-05-15",
        desc: "ព្រះ​រាជ​ពិធី​ច្រត់​ព្រះ​នង្គ័ល (Royal Ploughing Ceremony)"
    },
    {
        day: "2026-06-18",
        desc: "ព្រះ​រាជ​ពិធី​បុណ្យ​ចម្រើន​ព្រះ​ជន្ម សម្តេច​ព្រះ​មហាក្សត្រី នរោត្តម មុនិនាថ សីហនុ ព្រះ​វររាជ​មាតា​ជាតិ​ខ្មែរ ក្នុង​សេរីភាព សេចក្តីថ្លៃថ្នូរ និង​សុភមង្គល (Queen Mother's Birthday)"
    },

]

function holiday(){
var calendar = document.getElementById('tb-calendar').getElementsByTagName('tbody')[0];
for (let i = 0; i < calendar.rows.length; i++) {

    for (r = 0; r < calendar.rows[i].cells.length; r++) {
        var td = calendar.rows[i].cells[r];
        var val = khmer_holidays.find((e) => e.day == td.id);
        if (val) {

            const link = document.createElement('a');
            link.setAttribute('href', 'https://example.com');
            link.textContent = '';
            td.appendChild(link);
            td.classList.add('holiday');
            td.setAttribute('title',val.desc);
            td.addEventListener('click',function(e){
                var elm = e.target.getAttribute('title');
                alert(elm);
            });
            console.log(val.day,val.desc);
        }

    }
}
}



