import React from "react";
import DeviceMonitor from "../components/DeviceMonitor";
import IPTracker from "../components/IPTracker";

export default function About() {
  return (
    <section>
      <h4>អំពីយើង</h4>
      <p>
        គេហទំព័រនេះត្រូវបានបង្កើតឡើង ដើម្បីផ្តល់ជូននូវព័ត៌មានដែលមានភាព{" "}
        <strong>ត្រឹមត្រូវ ទាន់សម័យ និងអាចជឿទុកចិត្តបាន</strong>{" "}
        សម្រាប់ប្រជាពលរដ្ឋ និងអាជីវកម្មនៅក្នុងព្រះរាជាណាចក្រកម្ពុជា។
        យើងផ្តោតជាចម្បងលើ៖ ប្រតិទិន និងថ្ងៃឈប់សម្រាកប្រចាំខែ និងប្រចាំឆ្នាំ
        អត្រាប្តូរប្រាក់ប្រចាំថ្ងៃ (Official Exchange Rate) តម្លៃទីផ្សារ
        និងតម្លៃហាងឆេង សេវាទិន្នន័យ API សម្រាប់អ្នកអភិវឌ្ឍន៍
      </p>
      <p>
        ព័ត៌មានអត្រាប្តូរប្រាក់ត្រូវបានយោង និងដកស្រង់ដោយផ្ទាល់ពី ធនាគារជាតិ
        នៃកម្ពុជា (National Bank of Cambodia) <a href="https://www.nbc.gov.kh/">https://www.nbc.gov.kh/</a>{" "}
        ដោយអនុវត្តតាមគោលការណ៍ និងបទប្បញ្ញត្តិពាក់ព័ន្ធរបស់ ក្រសួងសេដ្ឋកិច្ច
        និងហិរញ្ញវត្ថុ។ សេវាកម្មទាំងអស់ត្រូវបានផ្តល់ជូន ដោយឥតគិតថ្លៃ
        ដើម្បីជួយសម្រួលដល់ការប្រើប្រាស់ព័ត៌មានហិរញ្ញវត្ថុ
        និងការធ្វើផែនការផ្សេងៗជារៀងរាល់ថ្ងៃ។
      </p>
      <h4>យើងមានគោលបំណង៖</h4>
      <p>
        ផ្តល់ព័ត៌មានអត្រាប្តូរប្រាក់ថ្មីៗ និងមានភាពជាក់លាក់
        បង្ហាញតម្លៃហាងឆេងពីប្រភពជឿទុកចិត្តបាន
        ជួយអ្នកប្រើប្រាស់ធ្វើការសម្រេចចត្តផ្នែកហិរញ្ញវត្ថុបានកាន់តែងាយស្រួល
        ផ្តល់សេវា API សម្រាប់អ្នកអភិវឌ្ឍន៍ប្រើប្រាស់ទិន្នន័យដោយសេរី រក្សាទុក
        និងការពារទិន្នន័យអ្នកប្រើប្រាស់ដោយយើងខ្ញុំយកចិត្តទុកដាក់ខ្ពស់។
      </p>
      <h4>តើគេហទំព័រនេះមានអ្វីខុសប្លែកពីគេហទំព័រផ្សេងៗទៀត?</h4>
      <p>
        យើងផ្តោតលើការផ្តល់ព័ត៌មានដែលមានភាពជាក់លាក់ និងទាន់សម័យ
        គេហទំព័រនេះត្រូវបានរចនាឡើងឲ្យប្រើប្រាស់ងាយស្រួល លឿន
        និងអាចចូលប្រើបានគ្រប់ឧបករណ៍។
      </p>
      <h4>ប្រព័ន្ធសុវត្តិភាព</h4>
      <p>
        យើងយកចិត្តទុកដាក់ខ្ពស់ក្នុងការការពារទិន្នន័យអ្នកប្រើប្រាស់។
        គេហទំព័រនេះប្រើប្រាស់វិធីសាស្រ្តសុវត្តិភាពសមស្រប ដើម្បីធានាថា
        ព័ត៌មានរបស់អ្នកមានសុវត្តិភាព មិនត្រូវបានលេចធ្លាយ និងការពារ។
        គេហទំព័រនេះត្រូវបានរចនាឡើងឲ្យមានប្រព័ន្ធសុវត្តិភាពខ្ពស់ និង
        ស្តង់ដាដោយបានបំពាក់នៅ Coentent Security Policy (CSP) ធ្វើការត្រួតពិនិត្យ
        ហើយទទួលបានពិន្ទុខ្ពស់ បញ្ជាក់ថាមានសុវត្តិភាពខ្ពស់បំផុត។
      </p>
      <h4>ទំនាក់ទំនង</h4>
      <p>
        បើអ្នកមានសំណួរ ឬចង់ផ្តល់មតិយោបល់ សូមទំនាក់ទំនងមកយើងខ្ញុំតាមរយៈអ៊ីមែល{" "}
        <a href="mailto:phaneth2014@gmail.com">phaneth2014@gmail.com</a>
      </p>
      <DeviceMonitor />
      <IPTracker/>
    </section>
  );
}
